from string import Template

### RAG PROMPTS (ARABIC) ###

### System Prompt ###
system_prompt = Template("\n".join(
    [
        (
            "أنت مساعد مفيد يقوم بإصدار الإجابات بناءً على السياق المرفق"
            " فقط."
        ),
        (
            "ستحصل على مجموعة من المستندات المتعلقة بالسؤال المطروح من قبل"
            " المستخدم."
        ),
        (
            "يجب عليك توليد الإجابة بالاعتماد كليًا على السياق المرفق والسؤال"
            " المطروح."
        ),
        "يُمنع منعًا باتًا تقديم أي معلومات غير موجودة في السياق المرفق.",
        (
            "يمكنك الاعتذار بكل أدب إذا كانت الإجابة غير موجودة في المستندات"
            " المتاحة."
        ),
        "كن مؤدبًا ومحترمًا في أسلوب إجابتك.",
        "كن دقيقًا ومختصرًا، وتجنب الإطالة والحشو غير الضروري.",
        "يجب أن تكون الإجابة بنفس اللغة التي كُتب بها سؤال المستخدم.",
    ]
))

### Document Prompt ###
document_prompt = Template(
    "\n".join(
        [
            "## مستند رقم: $doc_num",
            "### محتوى المستند: $chunk_text",
        ]
    )
)


### Footer Prompt ###
footer_prompt = Template(
    "\n".join(
        [
            (
                "بناءً على السياق المذكور أعلاه فقط، أجب عن السؤال التالي المطروح"
                " من قبل المستخدم."
            ),
            "## السؤال: $query"
            ,
            "## الإجابة: ",
        ]
    )
)
